ghi-electronics/TinyCLR-Ports/Targets/LPC23xx_LPC24xx/LPC24_USBC.cpp
}

void LPC24_UsbClient_Connect(bool con) {
    LPC24_UsbClient_WrCmdDat(CMD_SET_DEV_STAT, DAT_WR_BYTE(con ? DEV_CON : 0));
}

uint32_t LPC24_UsbClient_EPAdr(uint32_t EPNum, int8_t in) {
    uint32_t val;

    val = (EPNum & 0x0F) << 1;
    if (in) {
        val += 1;
    }
    return (val);
}

static uint32_t USB_WriteEP(uint32_t EPNum, uint8_t *pData, uint32_t cnt) {
    uint32_t n, g;
    USBCtrl = ((EPNum & 0x0F) << 2) | CTRL_WR_EN;

    USBTxPLen = cnt;

    for (n = 0; n < (cnt + 3) / 4; n++) {
        g = *(pData + 3);
        g <<= 8;
        g |= *(pData + 2);
        g <<= 8;
        g |= *(pData + 1);
        g <<= 8;
        g |= *pData;
        USBTxData = g;
        pData += 4;
    }

    USBCtrl = 0;

    LPC24_UsbClient_WrCmd(CMD_SEL_EP(LPC24_UsbClient_EPAdr(EPNum, 1)));
    LPC24_UsbClient_WrCmd(CMD_VALID_BUF);

    return (cnt);
}

static uint32_t LPC24_UsbClient_ReadEP(uint32_t EPNum, uint8_t *pData) {
    uint32_t cnt, n, d;

    USBCtrl = ((EPNum & 0x0F) << 2) | CTRL_RD_EN;

    do {
        cnt = USBRxPLen;
    } while ((cnt & PKT_RDY) == 0);

    cnt &= PKT_LNGTH_MASK;

    for (n = 0; n < (cnt + 3) / 4; n++) {
        d = USBRxData;
        *pData++ = d;
        *pData++ = d >> 8;
        *pData++ = d >> 16;
        *pData++ = d >> 24;
    }

    USBCtrl = 0;

    if (((EP_MSK_ISO >> EPNum) & 1) == 0)    /* Non-Isochronous Endpoint */
    {
        LPC24_UsbClient_WrCmd(CMD_SEL_EP(LPC24_UsbClient_EPAdr(EPNum, 0)));
        LPC24_UsbClient_WrCmd(CMD_CLR_BUF);
    }

    return (cnt);
}

static void LPC24_UsbClient_SetStallEP(uint32_t EPNum, int8_t in) {
    LPC24_UsbClient_WrCmdDat(CMD_SET_EP_STAT(LPC24_UsbClient_EPAdr(EPNum, in)), DAT_WR_BYTE(EP_STAT_ST));
}

void LPC24_UsbClient_ProcessEndPoint(USB_CONTROLLER_STATE* usbState, int32_t ep, int32_t in) {
    int32_t val;

    if (in) {
        LPC24_UsbClient_Enpoint_TxInterruptHandler(usbState, ep);
    }
    else {
        USBEpIntClr = 1 << LPC24_UsbClient_EPAdr(ep, in);
        while ((USBDevIntSt & CDFULL_INT) == 0);
        val = USBCmdData;
        LPC24_UsbClient_Enpoint_RxInterruptHandler(usbState, ep);
    }
}

void LPC24_UsbClient_ConfigEP(uint8_t ep_addr, int8_t in, uint8_t size) {
    uint32_t num;

    num = LPC24_UsbClient_EPAdr(ep_addr, in);
    USBReEp |= (1 << num);
    USBEpInd = num;
    USBEpMaxPSize = size;

    while ((USBDevIntSt & EP_RLZED_INT) == 0);

    USBDevIntClr = EP_RLZED_INT;
}
void LPC24_UsbClient_EnableEP(uint32_t EPNum, int8_t in) {
    LPC24_UsbClient_WrCmdDat(CMD_SET_EP_STAT(LPC24_UsbClient_EPAdr(EPNum, in)), DAT_WR_BYTE(0));
}
void USB_DisableEP(int32_t EPNum, int8_t in) {
    LPC24_UsbClient_WrCmdDat(CMD_SET_EP_STAT(LPC24_UsbClient_EPAdr(EPNum, in)), DAT_WR_BYTE(EP_STAT_DA));
}
void LPC24_UsbClient_ResetEP(uint32_t EPNum, int8_t in) {
    LPC24_UsbClient_WrCmdDat(CMD_SET_EP_STAT(LPC24_UsbClient_EPAdr(EPNum, in)), DAT_WR_BYTE(0));
}

void USB_HW_Configure(bool cfg) {
    LPC24_UsbClient_WrCmdDat(CMD_CFG_DEV, DAT_WR_BYTE(cfg ? CONF_DVICE : 0));

    USBReEp = 0x00000003;
    while ((USBDevIntSt & EP_RLZED_INT) == 0);
    USBDevIntClr = EP_RLZED_INT;
}

void LPC24_UsbClient_StartHardware() {
    *(uint32_t*)0xE01FC0C4 |= 0x80000000;
    USBClkCtrl = (1 << 1) | (1 << 3) | (1 << 4);

    LPC24_UsbClient_PinConfiguration();

    LPC24_UsbClient_HardwareReset();
    LPC24_UsbClient_SetAddress(0);

    USBDevIntEn = DEV_STAT_INT;	/* Enable Device Status Interrupt */

    LPC24_UsbClient_Connect(false);
    // delay if removed and then connected...
    LPC24_Time_Delay(nullptr, 120 * 1000);

    LPC24_UsbClient_Connect(true);
}

void LPC24_UsbClient_StopHardware() {
    LPC24_UsbClient_Connect(false);
}

void LPC24_UsbClient_TxPacket(USB_CONTROLLER_STATE* usbState, int32_t endpoint) {
    DISABLE_INTERRUPTS_SCOPED(irq);

    // transmit a packet on UsbPortNum, if there are no more packets to transmit, then die
    USB_PACKET64* Packet64;

    for (;;) {
        Packet64 = TinyCLR_UsbClient_TxDequeue(usbState, endpoint);

        if (Packet64 == nullptr || Packet64->Size > 0) {
            break;
        }
    }

    if (Packet64) {

        USB_WriteEP(endpoint, Packet64->Buffer, Packet64->Size);

        lcp17_UsbClientController[usbState->controllerNum].txNeedZLPS[endpoint] = false;
        if (Packet64->Size == 64)
            lcp17_UsbClientController[usbState->controllerNum].txNeedZLPS[endpoint] = true;
    }
    else {
        // send the zero length packet since we landed on the FIFO boundary before
        // (and we queued a zero length packet to transmit)
        if (lcp17_UsbClientController[usbState->controllerNum].txNeedZLPS[endpoint]) {
            USB_WriteEP(endpoint, (uint8_t*)nullptr, 0);
            lcp17_UsbClientController[usbState->controllerNum].txNeedZLPS[endpoint] = false;
        }

        // no more data
        lcp17_UsbClientController[usbState->controllerNum].txRunning[endpoint] = false;
    }
}
void LPC24_UsbClient_ControlNext(USB_CONTROLLER_STATE *usbState) {
    if (usbState->dataCallback) {
        // this call can't fail
        usbState->dataCallback(usbState);

        if (usbState->dataSize == 0) {
            USB_WriteEP(CONTORL_EP_ADDR, (uint8_t*)nullptr, 0);
            usbState->dataCallback = nullptr;                         // Stop sending stuff if we're done
        }
        else {
            USB_WriteEP(CONTORL_EP_ADDR, usbState->ptrData, usbState->dataSize);

            if (usbState->dataSize < LPC24_USB_ENDPOINT_SIZE) // If packet is less than full length
            {
                usbState->dataCallback = nullptr; // Stop sending stuff if we're done
            }

            // special handling the USB driver set address test, cannot use the first descriptor as the ADDRESS state is handle in the hardware
            if (lcp17_UsbClientController[usbState->controllerNum].firstDescriptorPacket) {
                usbState->dataCallback = nullptr;
            }

        }
    }
}

#define USB_USBCLIENT_ID 0
void LPC24_UsbClient_InterruptHandler(void* param) {
    DISABLE_INTERRUPTS_SCOPED(irq);
    int32_t disr, val, n, m;

