ghi-electronics/TinyCLR-Ports/Targets/LPC23xx_LPC24xx/LPC24_USBC.cpp
    disr = USBDevIntSt;                      /* Device Interrupt Status */
    USBDevIntClr = disr;                       /* A known issue on LPC214x */

    USB_CONTROLLER_STATE *usbState = lcp17_UsbClientController[USB_USBCLIENT_ID].usbState;

    if (disr & DEV_STAT_INT) {
        LPC24_UsbClient_WrCmd(CMD_GET_DEV_STAT);
        val = LPC24_UsbClient_RdCmdDat(DAT_GET_DEV_STAT);       /* Device Status */

        if (val & DEV_RST)                     /* Reset */
        {
            LPC24_UsbClient_ResetEvent(usbState);
        }

        if (val & DEV_SUS_CH)                  /* Suspend/Resume */
        {
            if (val & DEV_SUS)                   /* Suspend */
            {
                LPC24_UsbClient_SuspendEvent(usbState);
            }
            else                               /* Resume */
            {
                LPC24_UsbClient_ResumeEvent(usbState);
            }
        }

        goto isr_end;
    }

    /* Endpoint's Slow Interrupt */
    if (disr & EP_SLOW_INT) {
        for (n = 0; n < USB_EP_NUM; n++)     /* Check All Endpoints */
        {
            if ((USBEpIntSt & (1 << n))) {
                m = n >> 1;

                if (m == 0)//EP0
                {
                    USBEpIntClr = 1 << n;
                    while ((USBDevIntSt & CDFULL_INT) == 0);
                    val = USBCmdData;

                    if (val & EP_SEL_STP)        /* Setup Packet */
                    {
                        LPC24_UsbClient_ProcessEP0(usbState, 0, 1);// out setup
                        continue;
                    }
                    if ((n & 1) == 0)                /* OUT Endpoint */
                    {
                        LPC24_UsbClient_ProcessEP0(usbState, 0, 0);// out not setup
                    }
                    else {
                        LPC24_UsbClient_ProcessEP0(usbState, 1, 0);// in not setup
                    }

                    continue;
                }
                if ((n & 1) == 0)                /* OUT Endpoint */
                {
                    LPC24_UsbClient_ProcessEndPoint(usbState, m, 0);//out
                }
                else                           /* IN Endpoint */
                {
                    LPC24_UsbClient_ProcessEndPoint(usbState, m, 1);//in
                }
            }
        }
    }
isr_end:
    return;
}

void LPC24_UsbClient_ProcessEP0(USB_CONTROLLER_STATE *usbState, int32_t in, int32_t setup) {
    uint32_t EP_INTR;
    int32_t i;

    DISABLE_INTERRUPTS_SCOPED(irq);

    if (setup) {
        uint8_t   len = 0;

        len = LPC24_UsbClient_ReadEP(0x00, usbState->controlEndpointBuffer);

        // special handling for the very first SETUP command - Getdescriptor[DeviceType], the host looks for 8 bytes data only
        TinyCLR_UsbClient_SetupPacket* Setup = (TinyCLR_UsbClient_SetupPacket*)&usbState->controlEndpointBuffer[0];
        if ((Setup->Request == USB_GET_DESCRIPTOR) && (((Setup->Value & 0xFF00) >> 8) == USB_DEVICE_DESCRIPTOR_TYPE) && (Setup->Length != 0x12))
            lcp17_UsbClientController[usbState->controllerNum].firstDescriptorPacket = true;
        else
            lcp17_UsbClientController[usbState->controllerNum].firstDescriptorPacket = false;

        // send it to the upper layer
        usbState->ptrData = &usbState->controlEndpointBuffer[0];
        usbState->dataSize = len;

        uint8_t result = TinyCLR_UsbClient_ControlCallback(usbState);

        switch (result) {
        case USB_STATE_ADDRESS:
            LPC24_UsbClient_DeviceAddress = usbState->address | 0x80;
            break;

        case USB_STATE_DONE:
            usbState->dataCallback = nullptr;
            break;

        case USB_STATE_STALL:
            LPC24_UsbClient_SetStallEP(0, 0);
            LPC24_UsbClient_SetStallEP(0, 1);
            break;

        case USB_STATE_CONFIGURATION:
            USB_HW_Configure(true);
            for (i = 1; i < 16; i++) {
                // direction in
                LPC24_UsbClient_ConfigEP(i, 1, 64);
                LPC24_UsbClient_EnableEP(i, 1);
                LPC24_UsbClient_ResetEP(i, 1);

                // direction out
                LPC24_UsbClient_ConfigEP(i, 0, 64);
                LPC24_UsbClient_EnableEP(i, 0);
                LPC24_UsbClient_ResetEP(i, 0);
            }

            break;

        }

        if (result != USB_STATE_STALL) {
            LPC24_UsbClient_ControlNext(usbState);

            // If the port is configured, then output any possible withheld data
            if (result == USB_STATE_CONFIGURATION) {
                for (int32_t ep = 0; ep < LPC24_USB_ENDPOINT_COUNT; ep++) {
                    if (usbState->isTxQueue[ep])
                        LPC24_UsbClient_StartOutput(usbState, ep);
                }
            }
        }
    }
    else if (in) {
        // If previous packet has been sent and UDC is ready for more
        LPC24_UsbClient_ControlNext(usbState);      // See if there is more to send

        if (LPC24_UsbClient_DeviceAddress & 0x80) {
            LPC24_UsbClient_DeviceAddress &= 0x7F;
            LPC24_UsbClient_SetAddress(LPC24_UsbClient_DeviceAddress);
        }
    }
}

void LPC24_UsbClient_Enpoint_TxInterruptHandler(USB_CONTROLLER_STATE *usbState, uint32_t endpoint) {
    uint32_t EP_INTR;
    int32_t val;

    if (USBEpIntSt & (1 << LPC24_UsbClient_EPAdr(endpoint, 1)))//done sending?
    {
        //clear interrupt flag
        USBEpIntClr = 1 << LPC24_UsbClient_EPAdr(endpoint, 1);
        while ((USBDevIntSt & CDFULL_INT) == 0);
        val = USBCmdData;

        // successfully transmitted packet, time to send the next one
        LPC24_UsbClient_TxPacket(usbState, endpoint);
    }
}

void LPC24_UsbClient_Enpoint_RxInterruptHandler(USB_CONTROLLER_STATE *usbState, uint32_t endpoint) {
    bool          DisableRx;
    USB_PACKET64* Packet64 = TinyCLR_UsbClient_RxEnqueue(usbState, endpoint, DisableRx);

    /* copy packet in, making sure that Packet64->Buffer is never overflowed */
    if (Packet64) {
        uint8_t   len = 0;//USB.UDCBCRx[EPno] & LPC24xx_USB::UDCBCR_mask;
        uint32_t* packetBuffer = (uint32_t*)Packet64->Buffer;
        len = LPC24_UsbClient_ReadEP(endpoint, Packet64->Buffer);

        // clear packet status
        nacking_rx_OUT_data[endpoint] = 0;
        Packet64->Size = len;
    }
    else {
        /* flow control should absolutely protect us from ever
        getting here, so if we do, it is a bug */
        nacking_rx_OUT_data[endpoint] = 1;//we will need to triger next interrupt
    }

