ghi-electronics/TinyCLR-Ports/Targets/LPC23xx_LPC24xx/LPC24_USBC.cpp
}

void LPC24_UsbClient_SuspendEvent(USB_CONTROLLER_STATE *usbState) {
    // SUSPEND event only happened when Host(PC) set the device to SUSPEND
    // as there is always SOF every 1ms on the BUS to keep the device from
    // suspending. Therefore, the REMOTE wake up is not necessary at the ollie side
    lcp17_UsbClientController[usbState->controllerNum].previousDeviceState = usbState->deviceState;

    usbState->deviceState = USB_DEVICE_STATE_SUSPENDED;

    TinyCLR_UsbClient_StateCallback(usbState);
}


void LPC24_UsbClient_ResumeEvent(USB_CONTROLLER_STATE *usbState) {
    usbState->deviceState = lcp17_UsbClientController[usbState->controllerNum].previousDeviceState;

    TinyCLR_UsbClient_StateCallback(usbState);
}

void LPC24_UsbClient_ResetEvent(USB_CONTROLLER_STATE *usbState) {
    LPC24_UsbClient_HardwareReset();
    LPC24_UsbClient_DeviceAddress = 0;

    // clear all flags
    TinyCLR_UsbClient_ClearEvent(usbState, 0xFFFFFFFF);

    for (int32_t ep = 0; ep < LPC24_USB_ENDPOINT_COUNT; ep++) {
        lcp17_UsbClientController[usbState->controllerNum].txRunning[ep] = false;
        lcp17_UsbClientController[usbState->controllerNum].txNeedZLPS[ep] = false;
    }

    usbState->deviceState = USB_DEVICE_STATE_DEFAULT;
    usbState->address = 0;
    TinyCLR_UsbClient_StateCallback(usbState);
}

bool LPC24_UsbClient_ProtectPins(int32_t controller, bool On) {
    USB_CONTROLLER_STATE *usbState = lcp17_UsbClientController[controller].usbState;

    DISABLE_INTERRUPTS_SCOPED(irq);

    if (usbState) {
        if (On) {
            usbState->deviceState = USB_DEVICE_STATE_ATTACHED;

            TinyCLR_UsbClient_StateCallback(usbState);

            LPC24_UsbClient_StartHardware();
        }
        else {
            LPC24_UsbClient_HardwareReset();

            LPC24_UsbClient_DeviceAddress = 0;

            LPC24_UsbClient_StopHardware();
        }

        return true;
    }

    return false;
}

int8_t TinyCLR_UsbClient_GetControllerCount() {
    return LPC24_TOTAL_USB_CONTROLLERS;
}

bool TinyCLR_UsbClient_Initialize(USB_CONTROLLER_STATE* usbState) {
    return LPC24_UsbClient_Initialize(usbState);
}

bool TinyCLR_UsbClient_Uninitialize(USB_CONTROLLER_STATE* usbState) {
    return LPC24_UsbClient_Uninitialize(usbState);
}

bool TinyCLR_UsbClient_StartOutput(USB_CONTROLLER_STATE* usbState, int32_t endpoint) {
    return LPC24_UsbClient_StartOutput(usbState, endpoint);
}

bool TinyCLR_UsbClient_RxEnable(USB_CONTROLLER_STATE* usbState, int32_t endpoint) {
    return LPC24_UsbClient_RxEnable(usbState, endpoint);
}

void TinyCLR_UsbClient_Delay(uint64_t microseconds) {
    LPC24_Time_Delay(nullptr, microseconds);
}

void TinyCLR_UsbClient_InitializeConfiguration(USB_CONTROLLER_STATE *usbState) {
    LPC24_UsbClient_InitializeConfiguration(usbState);
}

uint32_t TinyCLR_UsbClient_GetEndpointSize(int32_t endpoint) {
    return endpoint == 0 ? LPC24_USB_ENDPOINT0_SIZE : LPC24_USB_ENDPOINT_SIZE;
}

